Catalogs/ДействияРабочегоПроцесса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>ДействияРабочегоПроцесса</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОснования</Name>
					<Comment>Для дополнительного разделения оснований (ЗаказПокупателя/Заказ-наряд)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеИмяОснования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипДействия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДействийРабочегоПроцесса</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонСообщения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныСообщений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>НастройкиЗаполнения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяРеквизита</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВариантЗаполнения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/НапоминанияПользователя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>НапоминанияПользователя</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СрокНапоминания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособУстановкиВремениНапоминания</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыУстановкиВремениНапоминания</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнтервалВремениНапоминания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяРеквизитаИсточника</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Расписание</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеИсточника</Name>
					<Comment>Представление источника</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВремяСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:TypeSet>cfg:ExchangePlanRef</v8:TypeSet>
						<v8:TypeSet>cfg:BusinessProcessRef</v8:TypeSet>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:ChartOfCalculationTypesRef</v8:TypeSet>
						<v8:TypeSet>cfg:TaskRef</v8:TypeSet>
						<v8:TypeSet>cfg:ChartOfCharacteristicTypesRef</v8:TypeSet>
						<v8:TypeSet>cfg:ChartOfAccountsRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ВыполнениеПравилРабочегоПроцесса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>ВыполнениеПравилРабочегоПроцесса</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаВыполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Правило</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПравилаРабочегоПроцесса</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СозданныйОбъект</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаданиеНаРаботу</v8:Type>
						<v8:Type>cfg:CatalogRef.ЗаписиКалендаряСотрудника</v8:Type>
						<v8:Type>cfg:DocumentRef.Событие</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Действие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДействияРабочегоПроцесса</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ТипыДействийРабочегоПроцесса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ТипыДействийРабочегоПроцесса</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОтправитьEmail</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтправитьSMS</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СоздатьСобытие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СоздатьЗаданиеНаРаботу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СоздатьЗаписьКалендаря</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СоздатьНапоминание</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТипыСобытий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ТипыСобытий</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ТелефонныйЗвонок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЛичнаяВстреча</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭлектронноеПисьмо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СообщениеSMS</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СпособыУстановкиВремениНапоминания.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>СпособыУстановкиВремениНапоминания</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВУказанноеВремя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтносительноТекущегоВремени</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтносительноВремениПредмета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Периодически</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ЗаданиеНаРаботу.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>ЗаданиеНаРаботу</Name>
			<BasedOn>
				<xr:Item>Document.Событие</xr:Item>
				<xr:Item>Document.ЗаказПокупателя</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЗаданияНаРаботу</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийЗаданиеНаРаботу</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидРабот</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЦен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КалендарьСотрудника</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КалендариСотрудников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоложениеВидаРабот</Name>
					<Comment>Положение вида работ (в шапке, в списке)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ПоложениеРеквизитаНаФорме</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Событие</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Событие</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СостоянияСобытий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХозяйственнаяОперация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозяйственныеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Работы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидРабот</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Заказчик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Трудоемкость</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/ДействияРабочегоПроцесса/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Процедура выполняет действия правил рабочего процесса.
// Вызывается из РабочиеПроцессы.ОбработатьПравилаРабочихПроцессов()
//
// Параметры:
//  Действия - Массив	 - массив элементов СправочникСсылка.ДействияРабочегоПроцесса
//  Источник - Ссылка	 - тип ссылки зависит от поддерживаемых источников правил
//  Правило	 - СправочникСсылка.ПравилаРабочегоПроцесса	 - выполняемое правило
//  Автор	 - СправочникСсылка.Пользователи	 - пользователь, от лица которого выполняется правило
//
Процедура ВыполнитьДействияПоИсточнику(Действия, Источник, Правило, Автор) Экспорт
	
	Если Не ОбщегоНазначения.СсылкаСуществует(Источник) Тогда
		Возврат;
	КонецЕсли;
	
	МетаданныеИсточника	= Источник.Метаданные();
	МенеджерИсточника	= ОбщегоНазначения.МенеджерОбъектаПоСсылке(Источник);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДействияРабочегоПроцессаНастройкиЗаполнения.Ссылка,
		|	ДействияРабочегоПроцессаНастройкиЗаполнения.ИмяРеквизита,
		|	ДействияРабочегоПроцессаНастройкиЗаполнения.ВариантЗаполнения,
		|	ДействияРабочегоПроцессаНастройкиЗаполнения.Значение
		|ИЗ
		|	Справочник.ДействияРабочегоПроцесса.НастройкиЗаполнения КАК ДействияРабочегоПроцессаНастройкиЗаполнения
		|ГДЕ
		|	ДействияРабочегоПроцессаНастройкиЗаполнения.Ссылка В(&Действия)
		|	И ДействияРабочегоПроцессаНастройкиЗаполнения.ВариантЗаполнения = &ВариантЗаполненияПоОснованию
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДействияРабочегоПроцесса.Ссылка,
		|	ДействияРабочегоПроцесса.ТипДействия,
		|	ДействияРабочегоПроцесса.ШаблонСообщения,
		|	ДействияРабочегоПроцесса.НастройкиЗаполнения.(
		|		ИмяРеквизита,
		|		ВариантЗаполнения,
		|		Значение
		|	)
		|ИЗ
		|	Справочник.ДействияРабочегоПроцесса КАК ДействияРабочегоПроцесса
		|ГДЕ
		|	ДействияРабочегоПроцесса.Ссылка В(&Действия)";
	
	Запрос.УстановитьПараметр("ВариантЗаполненияПоОснованию", "ИзОснования");
	Запрос.УстановитьПараметр("Действия", Действия);
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	РеквизитыОснования = Новый Массив; // для получения всех нужных для заполнения значений основания одним запросом
	Выборка = МассивРезультатов[0].Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ЗначениеНастройки = Выборка.Значение.Получить();
		
		Если МетаданныеИсточника.Реквизиты.Найти(ЗначениеНастройки) <> Неопределено Тогда
			РеквизитыОснования.Добавить(ЗначениеНастройки);
		КонецЕсли;
		
	КонецЦикла;
	
	Если РеквизитыОснования.Количество() > 0 Тогда
		ЗначенияРеквизитовИсточника = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Источник, РеквизитыОснования);
	КонецЕсли;
	
	ВыборкаДействий = МассивРезультатов[1].Выбрать();
	
	Пока ВыборкаДействий.Следующий() Цикл
		
		ВыборкаНастроек = ВыборкаДействий.НастройкиЗаполнения.Выбрать();
		
		ДатаВыполненияДействия = ТекущаяДатаСеанса();
		ДанныеЗаполнения = Источник;
		
		// 1. Определение типа для объекта приемника, и подготовка данных заполнения, специфичных для конкретного типа действия
		Если ВыборкаДействий.ТипДействия = Перечисления.ТипыДействийРабочегоПроцесса.СоздатьСобытие
			Или ВыборкаДействий.ТипДействия = Перечисления.ТипыДействийРабочегоПроцесса.ОтправитьEmail
			Или ВыборкаДействий.ТипДействия = Перечисления.ТипыДействийРабочегоПроцесса.ОтправитьSMS Тогда
			
			МетаданныеПриемника	= Метаданные.Документы.Событие;
			ПриемникОбъект		= Документы.Событие.СоздатьДокумент();
			ДанныеЗаполнения	= Новый Структура;
			ДанныеЗаполнения.Вставить("ОснованиеЗаполнения", Источник);
			
			Если ВыборкаНастроек.НайтиСледующий(Новый Структура("ИмяРеквизита", "ТипСобытия")) Тогда
				
				Значение = ВыборкаНастроек.Значение.Получить();
				Если ВыборкаНастроек.ВариантЗаполнения = "ИзОснования" Тогда
					Значение = ЗначенияРеквизитовИсточника[Значение];
				КонецЕсли;
				
				ДанныеЗаполнения.Вставить("ТипСобытия", Значение);
				ВыборкаНастроек.Сбросить();
				
			КонецЕсли;
			
		ИначеЕсли ВыборкаДействий.ТипДействия = Перечисления.ТипыДействийРабочегоПроцесса.СоздатьЗаданиеНаРаботу Тогда
			
			МетаданныеПриемника	= Метаданные.Документы.ЗаданиеНаРаботу;
			ПриемникОбъект		= Документы.ЗаданиеНаРаботу.СоздатьДокумент();
			
		ИначеЕсли ВыборкаДействий.ТипДействия = Перечисления.ТипыДействийРабочегоПроцесса.СоздатьЗаписьКалендаря Тогда
			
			МетаданныеПриемника	= Метаданные.Справочники.ЗаписиКалендаряСотрудника;
			ПриемникОбъект		= Справочники.ЗаписиКалендаряСотрудника.СоздатьЭлемент();
			
		ИначеЕсли ВыборкаДействий.ТипДействия = Перечисления.ТипыДействийРабочегоПроцесса.СоздатьНапоминание Тогда
			
			МетаданныеПриемника	= Метаданные.РегистрыСведений.НапоминанияПользователя;
			ПриемникОбъект		= РегистрыСведений.НапоминанияПользователя.СоздатьМенеджерЗаписи();
			
		КонецЕсли;
		
		// 2. Заполнение объекта приемника стандартным образом
		ПриемникОбъект.Заполнить(ДанныеЗаполнения);
		
		// 3. Установка специфических свойств от вида приемника
		Если ОбщегоНазначения.ЭтоСправочник(МетаданныеПриемника) Тогда
			
			ПриемникОбъект.УстановитьНовыйКод();
			ПриемникОбъект.ДополнительныеСвойства.Вставить("НеВыполнятьПравилаРабочегоПроцесса"); // для избежания рекурсии
			
		ИначеЕсли ОбщегоНазначения.ЭтоДокумент(МетаданныеПриемника) Тогда
			
			ПриемникОбъект.Дата = ДатаВыполненияДействия;
			ПриемникОбъект.УстановитьНовыйНомер();
			ПриемникОбъект.ДополнительныеСвойства.Вставить("НеВыполнятьПравилаРабочегоПроцесса");
			
		КонецЕсли;
		
		Если МетаданныеПриемника.Реквизиты.Найти("Комментарий") <> Неопределено Тогда
			ПриемникОбъект.Комментарий = "#" + НСтр("ru='Создан автоматически согласно правилам рабочего процесса';uk='Створено автоматично згідно з правилами робочого процесу'");
		КонецЕсли;
		
		Если МетаданныеПриемника.Реквизиты.Найти("Автор") <> Неопределено Тогда
			ПриемникОбъект.Автор = Автор;
		КонецЕсли;
		
		РеквизитыНедоступныеДляИсточника = МенеджерИсточника.РеквизитыНедоступныеДляИсточникаРабочегоПроцесса(ВыборкаДействий.ТипДействия);
		
		// 4. Заполнение реквизитов объекта приемника, согласно настройкам заполнения из действия рабочего процесса
		Пока ВыборкаНастроек.Следующий() Цикл
			
			Если ОбщегоНазначения.ЭтоРегистр(МетаданныеПриемника) Тогда
				
				Если МетаданныеПриемника.Измерения.Найти(ВыборкаНастроек.ИмяРеквизита) = Неопределено
					И МетаданныеПриемника.Ресурсы.Найти(ВыборкаНастроек.ИмяРеквизита) = Неопределено
					И МетаданныеПриемника.Реквизиты.Найти(ВыборкаНастроек.ИмяРеквизита) = Неопределено
					И Не ОбщегоНазначения.ЭтоСтандартныйРеквизит(МетаданныеПриемника.СтандартныеРеквизиты, ВыборкаНастроек.ИмяРеквизита) Тогда
					
					Продолжить;
				КонецЕсли;
				
			ИначеЕсли МетаданныеПриемника.Реквизиты.Найти(ВыборкаНастроек.ИмяРеквизита) = Неопределено
				И Не ОбщегоНазначения.ЭтоСтандартныйРеквизит(МетаданныеПриемника.СтандартныеРеквизиты, ВыборкаНастроек.ИмяРеквизита) Тогда
				
				Продолжить;
			КонецЕсли;
			
			ЗначениеНастройки = ВыборкаНастроек.Значение.Получить();
			
			Если ВыборкаНастроек.ВариантЗаполнения = "Указанный" Тогда
				
				ПриемникОбъект[ВыборкаНастроек.ИмяРеквизита] = ЗначениеНастройки;
				
			ИначеЕсли ВыборкаНастроек.ВариантЗаполнения = "ИзОснования" Тогда
				
				Если РеквизитыНедоступныеДляИсточника.Найти(ЗначениеНастройки) <> Неопределено Тогда
					Продолжить;
				КонецЕсли;
				
				ПриемникОбъект[ВыборкаНастроек.ИмяРеквизита] = ЗначенияРеквизитовИсточника[ЗначениеНастройки];
				
			ИначеЕсли ВыборкаНастроек.ВариантЗаполнения = "Смещение" Тогда
				
				ПриемникОбъект[ВыборкаНастроек.ИмяРеквизита] = ДатаСмещения(ДатаВыполненияДействия, ЗначениеНастройки);
				
			КонецЕсли;
			
		КонецЦикла;
		
		// 5. Заполнение реквизитов объекта приемника, зависящих от специфики выполняемого действия
		Если ВыборкаДействий.ТипДействия = Перечисления.ТипыДействийРабочегоПроцесса.СоздатьСобытие Тогда
			
			Если ПриемникОбъект.ТипСобытия = Перечисления.ТипыСобытий.ЭлектронноеПисьмо И Не ПустаяСтрока(ПриемникОбъект.Содержание) Тогда
				
				ФД = Новый ФорматированныйДокумент;
				ФД.Добавить(ПриемникОбъект.Содержание, Тип("ТекстФорматированногоДокумента"));
				
				ТекстHTML	= "";
				КартинкиТекстаHTML	= Новый Структура;
				ФД.ПолучитьHTML(ТекстHTML, КартинкиТекстаHTML);
				
				ПриемникОбъект.КартинкиHTML		= Новый ХранилищеЗначения(КартинкиТекстаHTML);
				ПриемникОбъект.СодержаниеHTML	= ТекстHTML;
				
			КонецЕсли;
			
		ИначеЕсли ВыборкаДействий.ТипДействия = Перечисления.ТипыДействийРабочегоПроцесса.СоздатьНапоминание Тогда
			
			ПриемникОбъект.Описание			= ОбщегоНазначения.ПредметСтрокой(Источник);
			ПриемникОбъект.Источник			= Источник;
			ПриемникОбъект.СрокНапоминания	= ПриемникОбъект.ВремяСобытия;
			ПриемникОбъект.СпособУстановкиВремениНапоминания = Перечисления.СпособыУстановкиВремениНапоминания.ВУказанноеВремя;
			
		ИначеЕсли ВыборкаДействий.ТипДействия = Перечисления.ТипыДействийРабочегоПроцесса.ОтправитьEmail Тогда
			
			Результат = Справочники.ШаблоныСообщений.СформироватьПоляСообщения(ВыборкаДействий.ШаблонСообщения, Источник);
			ПриемникОбъект.Тема				= Результат.Тема;
			ПриемникОбъект.Содержание		= Результат.Текст;
			ПриемникОбъект.СодержаниеHTML	= Результат.ТекстHTML;
			ПриемникОбъект.КартинкиHTML		= Новый ХранилищеЗначения(Результат.КартинкиТекстаHTML);
			ПриемникОбъект.ТипСобытия		= Перечисления.ТипыСобытий.ЭлектронноеПисьмо;
			ПриемникОбъект.Состояние		= Справочники.СостоянияСобытий.Запланировано;
			
			НоваяСтрока = ПриемникОбъект.ДокументыОснования.Добавить();
			НоваяСтрока.ДокументОснование = Источник;
			
			ЗаполнитьУчастниковСобытия(ВыборкаНастроек, ПриемникОбъект, ЗначенияРеквизитовИсточника);
			
			Если Не РегламентныеЗаданияСервер.РаботаСВнешнимиРесурсамиЗаблокирована() Тогда
				
				Попытка
					ПриемникОбъект.ОтправитьЭлектронноеПисьмо(Ложь);
				Исключение
					ТекстСообщения = СтрШаблон(НСтр("ru='Не удалось автоматически отправить электронное письмо, требуется отправка из События. При выполнении действия рабочего процесса: ""%1""."
"По причине: %2';uk='Не вдалося автоматично відправити електронний лист, потрібна відправка з Події. При виконанні дії робочого процесу: ""%1""."
"Внаслідок: %2'"), ВыборкаДействий.Ссылка, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
					ЗаписьЖурналаРегистрации(РабочиеПроцессы.СобытиеЖурналаРегистрации(), УровеньЖурналаРегистрации.Предупреждение,
						Метаданные.Справочники.ПравилаРабочегоПроцесса, Правило, ТекстСообщения);
				КонецПопытки;
				
			КонецЕсли;
			
		ИначеЕсли ВыборкаДействий.ТипДействия = Перечисления.ТипыДействийРабочегоПроцесса.ОтправитьSMS Тогда
			
			Результат = Справочники.ШаблоныСообщений.СформироватьПоляСообщения(ВыборкаДействий.ШаблонСообщения, Источник);
			ПриемникОбъект.Содержание	= Результат.Текст;
			ПриемникОбъект.ТипСобытия	= Перечисления.ТипыСобытий.СообщениеSMS;
			ПриемникОбъект.Состояние	= Справочники.СостоянияСобытий.Запланировано;
			
			НоваяСтрока = ПриемникОбъект.ДокументыОснования.Добавить();
			НоваяСтрока.ДокументОснование = Источник;
			
			ЗаполнитьУчастниковСобытия(ВыборкаНастроек, ПриемникОбъект, ЗначенияРеквизитовИсточника);
			
			Если Не РегламентныеЗаданияСервер.РаботаСВнешнимиРесурсамиЗаблокирована() Тогда
				
				Попытка
					ПриемникОбъект.ОтправитьSMS(Ложь);
				Исключение
					ТекстСообщения = СтрШаблон(НСтр("ru='Не удалось автоматически отправить SMS, требуется отправка из События. При выполнении действия рабочего процесса: ""%1""."
"По причине: %2';uk='Не вдалося автоматично відправити SMS, потрібна відправка з Події. При виконанні дії робочого процесу: ""%1""."
"Внаслідок: %2'"), ВыборкаДействий.Ссылка, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
					ЗаписьЖурналаРегистрации(РабочиеПроцессы.СобытиеЖурналаРегистрации(), УровеньЖурналаРегистрации.Предупреждение,
						Метаданные.Справочники.ПравилаРабочегоПроцесса, Правило, ТекстСообщения);
				КонецПопытки;
				
			КонецЕсли;
			
		КонецЕсли;
		
		// 6. Проверка согласованности заполненных реквизитов
		// В частности, возможна ситуация, когда в действии рабочего процесса для поля установлен вариант заполнения "ИзОснования",
		// поле является обязательным для заполнения в приемнике, но оказалось не заполненным в основании. В этом случае информация
		// запишется в журнал регистрации.
		Если Не ПриемникОбъект.ПроверитьЗаполнение() Тогда
			ТекстСообщения = СтрШаблон(НСтр("ru='Не удалось выполнить действие рабочего процесса: ""%1""."
"Некорретно заполнен создаваемый объект: %2';uk='Не вдалося виконати дію робочого процесу: ""%1""."
"Некоректно заповнений створюваний об`єкт: %2'"), ВыборкаДействий.Ссылка, МетаданныеПриемника.Представление());
			ЗаписьЖурналаРегистрации(РабочиеПроцессы.СобытиеЖурналаРегистрации(), УровеньЖурналаРегистрации.Ошибка,
				Метаданные.Справочники.ПравилаРабочегоПроцесса, Правило, ТекстСообщения);
			Продолжить;
		КонецЕсли;
		
		// 7. Запись объекта приемника
		ПриемникОбъект.Записать();
		
		// 8. Запись в журнал регистрации о выполнении действия
		ПредставлениеОбъекта = ?(ОбщегоНазначения.ЭтоСправочник(МетаданныеПриемника) Или ОбщегоНазначения.ЭтоДокумент(МетаданныеПриемника),
			Строка(ПриемникОбъект.Ссылка),
			МетаданныеПриемника.Представление()
		);
		ТекстСообщения = СтрШаблон(НСтр("ru='Действие рабочего процесса ""%1"" выполнено успешно,"
"создан объект: ""%2""';uk='Дія робочогу процесу ""%1"" виявилась успішною,"
"створений об`єкт: ""%2""'"), ВыборкаДействий.Ссылка, ПредставлениеОбъекта);
		ЗаписьЖурналаРегистрации(РабочиеПроцессы.СобытиеЖурналаРегистрации(), УровеньЖурналаРегистрации.Примечание,
			Метаданные.Справочники.ПравилаРабочегоПроцесса, Правило, ТекстСообщения);
		
		// 9. Запись в регистр для фиксации истории выполнения правила
		РегистрыСведений.ВыполнениеПравилРабочегоПроцесса.ЗафиксироватьВыполнениеПравила(
			Правило,
			ЗначениеСозданногоОбъекта(МетаданныеПриемника, ПриемникОбъект),
			ВыборкаДействий.Ссылка,
			ДатаВыполненияДействия
		);
		
	КонецЦикла;
	
КонецПроцедуры

// Функция возвращает рассчитаную дату смещения
//
// Параметры:
//  Дата	 - Дата	 - дата, относительно которой выполняется расчет
//  Смещение - Строка	 - вариант смещения
// 
// Возвращаемое значение:
//  Дата - Дата
//
Функция ДатаСмещения(знач Дата, знач Смещение) Экспорт
	
	Результат = '0001-01-01';
	
	Если Смещение = "Сразу" Тогда
		Результат = Дата;
	ИначеЕсли Смещение = "ЧерезЧас" Тогда
		Результат = Дата + 3600;
	ИначеЕсли Смещение = "ЧерезДень" Тогда
		Результат = Дата + 24 * 3600;
	ИначеЕсли Смещение = "ЧерезНеделю" Тогда
		Результат = Дата + 7 * 24 * 3600;
	ИначеЕсли Смещение = "ЧерезМесяц" Тогда
		Результат = ДобавитьМесяц(Дата, 1);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьУчастниковСобытия(ВыборкаНастроек, СобытиеОбъект, знач ЗначенияРеквизитовИсточника)
	
	ВыборкаНастроек.Сбросить();
	
	Если ВыборкаНастроек.НайтиСледующий(Новый Структура("ИмяРеквизита", "Контакт")) Тогда
		
		ЗначениеКонтакта = ВыборкаНастроек.Значение.Получить();
		Если ВыборкаНастроек.ВариантЗаполнения = "ИзОснования" Тогда
			ЗначениеКонтакта = ЗначенияРеквизитовИсточника[ЗначениеКонтакта];
		КонецЕсли;
		
		НоваяСтрока = СобытиеОбъект.Участники.Добавить();
		НоваяСтрока.Контакт = ЗначениеКонтакта;
		
		ВыборкаНастроек.Сбросить();
		
		Если ВыборкаНастроек.НайтиСледующий(Новый Структура("ИмяРеквизита", "ВидКонтактнойИнформации")) Тогда
			
			ЗначениеНастройки = ВыборкаНастроек.Значение.Получить();
			
			Если ВыборкаНастроек.ВариантЗаполнения = "ИзОснования" Тогда
				ЗначениеНастройки = ЗначенияРеквизитовИсточника[ЗначениеНастройки];
			КонецЕсли;
			
			НоваяСтрока.КакСвязаться = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ЗначениеКонтакта, ЗначениеНастройки);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ЗначениеСозданногоОбъекта(МетаданныеПриемника, ПриемникОбъект)
	
	// Ограничение: напоминания не являются ссылочным объектом,
	// поэтому в истории созданный объект сохраняется в виде строки с датой напоминания.
	// Если по одному действию создано несколько напоминаний с одинаковой датой,
	// то в истории выполнения сохранится только одно.
	
	Если МетаданныеПриемника = Метаданные.РегистрыСведений.НапоминанияПользователя Тогда
		Возврат "Напоминание " + Формат(ПриемникОбъект.СрокНапоминания, "HH.mm.ss dd.MM.yyyy");
	КонецЕсли;
	
	Возврат ПриемникОбъект.Ссылка;
	
КонецФункции

#КонецОбласти

#КонецЕсли
